{
    "1": {
        "key": "1",
        "date": " Jun 1, 2017",
        "reviewNo": "empReview_15299694",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "None",
        "summary": "Contractor",
        "pro": "Decent easy work but not very stimulating",
        "con": "bad hours hard to work normal hours.",
        "advice": "None",
        "overallStar": "3",
        "workLifeStar": "3",
        "cultureStar": "3",
        "careerOppStar": "3",
        "comBenefitsStar": "3",
        "srManagementStar": "3",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW15299694.htm"
    },
    "2": {
        "key": "2",
        "date": " Apr 18, 2017",
        "reviewNo": "empReview_14681655",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap full-time",
        "summary": "Content",
        "pro": "It is everchanging, exciting, and a company everyone knows.",
        "con": "job security is not the best.",
        "advice": "None",
        "overallStar": "4",
        "workLifeStar": "4",
        "cultureStar": "4",
        "careerOppStar": "4",
        "comBenefitsStar": "4",
        "srManagementStar": "4",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW14681655.htm"
    },
    "3": {
        "key": "3",
        "date": " Mar 16, 2017",
        "reviewNo": "empReview_14207622",
        "employeeType": "Former Employee - Anonymous Employee",
        "position": "I worked at Snap full-time",
        "summary": "Not a bad place to work",
        "pro": "Good perks, great growth trajectory",
        "con": "Environment can be closed and political",
        "advice": "Be more open to employees moving up",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW14207622.htm"
    },
    "4": {
        "key": "4",
        "date": " Mar 8, 2017",
        "reviewNo": "empReview_14109240",
        "employeeType": "Former Employee - Anonymous Employee",
        "position": "I worked at Snap full-time",
        "summary": "senior engineers stay away if you can",
        "pro": "looks great from outside but the company culture leaves a lot to be desired. Google for a business insider article on what it is like to work at this secretive company. it captures quite accurately what goes onMight still be a good place for junior engineers straight out of school to grow their initial careers",
        "con": "lot of technical debt and poor architecture decisions everywhere. top down decision making with a flavor for micro management across the entire chain of hierarchy. senior engineers are not empowered and trusted. working from home is frowned upon. Too many first time managers with no clue on how to grow engineering careers",
        "advice": "bureaucracy and rubber stamping is slowing the company down. cut the red tape to compete effectively against competitors with deep pockets",
        "overallStar": "2",
        "workLifeStar": "2",
        "cultureStar": "2",
        "careerOppStar": "2",
        "comBenefitsStar": "2",
        "srManagementStar": "2",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW14109240.htm"
    },
    "5": {
        "key": "5",
        "date": " Mar 4, 2017",
        "reviewNo": "empReview_14041714",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap full-time",
        "summary": "Very exciting place to be right now",
        "pro": "-Pay, perks and benefits-They seem to care about your relationship with your other coworkers. I've had people who claimed to work closely with the CEO adding me on snapchat and being very approachable and friendly. They love to hear more about your job there.-So far, every day has something new to offer, I doubt I'll get bored anytime soon-Lots of flexibility-Beach!!-All the pros overweight (most) of the cons so far.",
        "con": "-Very secretive, might make you a little more paranoid than you feel it's even necessary.-Right now, the separation of work versus personal life is starting to get too blurry for my taste.-I was told I was doing one type of job, turned out I had way more responsibility I agreed on for getting their base pay. Part of this was my own fault, but be sure to try and know exactly what you'll be asked to do. The (6 hour) interview wasn't clear enough, I assumed they were familiar with my type of job, and they didn't reveal what I was going to work on until my 3rd day of work.-No one really knows what they're doing, management is still lost but it's getting better, you still end up having to manage yourself more than anything, everyone is still trying to figure things out.-Venice beach hates us and for an understandable reason. Despite the amazing views and fun vibe, I agree this is really not a place for a corporation like this. I'm often afraid of getting out by myself. Your badge and backpack makes you easily recognizable.",
        "advice": "We all know that we need a better plan. Our manager is very smart, but it doesn't change the fact that it's very hard for one person who doesn't understand 100% of every single job they manage to represent everyone at the same time. We aren't a small company. I think having sub-managers would help solve part of that problem.",
        "overallStar": "4",
        "workLifeStar": "4",
        "cultureStar": "4",
        "careerOppStar": "4",
        "comBenefitsStar": "4",
        "srManagementStar": "4",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW14041714.htm"
    },
    "6": {
        "key": "6",
        "date": " Dec 7, 2016",
        "reviewNo": "empReview_12914409",
        "employeeType": "Former Employee - Anonymous Employee",
        "position": "None",
        "summary": "Decent",
        "pro": "Free breakfast, lunch, and dinner provided. Pay for your phone bill - up to $75 a month. Good, energetic group of people",
        "con": "Felt slightly mistreated as an intern and not respected as much as the full time employees although this may just be a case of N=1",
        "advice": "Make the workplace a little more welcoming to interns and don't undermine their abilities. Many of us produced results better than the full time employees!",
        "overallStar": "4",
        "workLifeStar": "4",
        "cultureStar": "4",
        "careerOppStar": "4",
        "comBenefitsStar": "4",
        "srManagementStar": "4",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW12914409.htm"
    },
    "7": {
        "key": "7",
        "date": " Oct 8, 2016",
        "reviewNo": "empReview_12238299",
        "employeeType": "Former Employee - Anonymous Employee",
        "position": "None",
        "summary": "Story Editor",
        "pro": "- Wonderful, ambitious-but-not-cutthroat coworkers- Fantastic food options- Great amenities + snacks- Famous product that the everyone under the age of 30 is familiar with; feel like you're changing the world and entertainment by working there- Great facilities and overall super cool work environment",
        "con": "- Crazy hours / days / nights / weekends (unique to Content team); that specific department really feels like it's still a start-up- Mild culture of workaholism- Given the impression that your professional opinion and advice matters in terms of building and changing the product but still very much a top-down structure with regards to creative and business-related decisions- Big lack of diversity in management (mostly straight white dudes)- Sometimes feel like you're not super highly-valued even though you're given the impression that your work is super important to the company with regards to revenue and profits- Arbitrary pay based on previous experience but not congruous with actual work done (i.e. there were people getting paid $20/hr, $24/hr, and $30/hr to do the exact same things)",
        "advice": "Management on Content needs to be way more diverse, and upper management needs to actually give a ____ about getting to know the people who work incredibly hard for them. It definitely sucked big-time being laid off by a dude who a) certainly couldn't identify me in a crowd as someone who worked for him, and b) seemed wildly unfamiliar with the day-to-day operations of the product he's \"running.\"",
        "overallStar": "4",
        "workLifeStar": "4",
        "cultureStar": "4",
        "careerOppStar": "4",
        "comBenefitsStar": "4",
        "srManagementStar": "4",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW12238299.htm"
    },
    "8": {
        "key": "8",
        "date": " Nov 5, 2016",
        "reviewNo": "empReview_12572820",
        "employeeType": "Former Employee - Anonymous Employee",
        "position": "None",
        "summary": "Lack of transparency",
        "pro": "Fun to work at a young, cutting edge technology company.",
        "con": "No transparency, treats employees like they're very disposable. Unless you're an engineer or on the design team get used to feeling out of the loop and undervalued.",
        "advice": "None",
        "overallStar": "2",
        "workLifeStar": "2",
        "cultureStar": "2",
        "careerOppStar": "2",
        "comBenefitsStar": "2",
        "srManagementStar": "2",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW12572820.htm"
    },
    "9": {
        "key": "9",
        "date": " Oct 14, 2016",
        "reviewNo": "empReview_12313254",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "None",
        "summary": "Producer",
        "pro": "Diversity of people who work there and benefits",
        "con": "Big company with a lot of different ideas and directions",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW12313254.htm"
    },
    "10": {
        "key": "10",
        "date": " Oct 12, 2016",
        "reviewNo": "empReview_12280361",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "None",
        "summary": "Great Company, Great Atmosphere and Culture",
        "pro": "Great people, you have everything you need to do you job, pay and benefits are very good",
        "con": "Not many cons, but the food in the morning could have healthier options (eggs, etc.)",
        "advice": "Provide healthier food options",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW12280361.htm"
    },
    "11": {
        "key": "11",
        "date": " Jan 15, 2017",
        "reviewNo": "empReview_13338127",
        "employeeType": "Current Employee - Software Engineer",
        "position": "I have been working at Snap (Less than a year)",
        "summary": "Engineer",
        "pro": "You work with the coolest people in the Los Angeles area! Teammates are usually helpful and responsive.",
        "con": "It's highly secretive company. You sometimes read new features on the headlines.",
        "advice": "None",
        "overallStar": "4",
        "workLifeStar": "4",
        "cultureStar": "4",
        "careerOppStar": "4",
        "comBenefitsStar": "4",
        "srManagementStar": "4",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW13338127.htm"
    },
    "12": {
        "key": "12",
        "date": " Jan 10, 2017",
        "reviewNo": "empReview_13273173",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap full-time",
        "summary": "Rapid Growth Means Opportunity",
        "pro": "Rapidly growing company means room for employees to grow.The Snapchat SW and Spectacles HW are successful products. Large user base. Advertising model is a value proposition.Seems like the sky is the limit. CEO has been right a lot. Quality of people coming in the door is high. Made some good hires from what I can see. People who know how to ship products and do so profitably.IPO paperwork has been filed. Could be a big payoff. Everyone works hard. It's good if you have something to show for it.Benefits are excellent compared with previous employers.",
        "con": "There's so much going on it can be hard to focus.No way of knowing how long the free wheeling culture will last.Roles and responsibilities beginning to overlap as more people are brought onboard, creates some confusion.Rapid growth and rate of hiring makes me wonder if company can execute on big plans.Long hours and demanding workload. Work/Life balance tips heavily towards work.",
        "advice": "When forming such a large team, do things to make sure everyone is pulling in the same direction. Keep an eye on company culture. Ask what can be done to maintain the fun of being a startup. Work to avoid politics and keep decision making and planning transparent.",
        "overallStar": "4",
        "workLifeStar": "4",
        "cultureStar": "4",
        "careerOppStar": "4",
        "comBenefitsStar": "4",
        "srManagementStar": "4",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW13273173.htm"
    },
    "13": {
        "key": "13",
        "date": " Nov 10, 2016",
        "reviewNo": "empReview_12626941",
        "employeeType": "Former Employee - Story Editor",
        "position": "I worked at Snap full-time (More than a year)",
        "summary": "An exciting job, marred by some organizational deficiencies",
        "pro": "I worked as a story editor on the content team, curating submitted snaps for their Live Stories. There are really good benefits and perks — you don't have to pay into healthcare, the snacks are pretty sweet, there are occasional activities like free group workout classes. You feel like you're working at one of the most exciting companies in the world. You can have a pretty big say in projects even without a ton of past work experience; Snapchat generally values the input and creativity of its employees, and wants be cooler and more innovative than anywhere else and that led to some really fruitful creative work. The pay is really good.",
        "con": "Horrific and irregular hours, far worse than initially advertised in the job description. It was not uncommon to work on both overnight and daytime shifts in the same week, which was nuts and totally destabilized any ability to have a social life outside of work. That's something that not might be visible from the outside, but attention toward employee wellness in this respect was minimal. There's a lack of diversity in the company overall — the content team at one point was definitely one of the more diverse teams (racially + gender-wise) but leadership and management is vastly white and male, which led to interpersonal issues and some tone-deafness in regard to content decisions. A relatively flat organizational structure meant it was difficult to get promoted or see the potential for a longer-term career ladder.",
        "advice": "Schedule your content team more conscientiously. Hire more people who don't look like you. Set better standards for work-life balance. Offer more opportunities for growth and advancement.",
        "overallStar": "3",
        "workLifeStar": "3",
        "cultureStar": "3",
        "careerOppStar": "3",
        "comBenefitsStar": "3",
        "srManagementStar": "3",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW12626941.htm"
    },
    "14": {
        "key": "14",
        "date": " Dec 8, 2016",
        "reviewNo": "empReview_12928944",
        "employeeType": "Current Employee - Software Engineer",
        "position": "None",
        "summary": "Current SWE",
        "pro": "Good location and food; good company vision.Location: Venice beach is a lively tourist location with good weather and quirky locals.Food: You get 3 meals per week at local restaurants, most of which are pretty good. Use them if you don't like what's in the cafeterias.Vision: Evan Spiegel is a gifted product designer and I enjoy making his products.",
        "con": "The company is not as established as larger companies like FB or Google, so we don't have every perk imaginable yet, and a lot of internal tools are yet to be built. Internal hackathons are few and far-between.",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW12928944.htm"
    },
    "15": {
        "key": "15",
        "date": " Sep 27, 2016",
        "reviewNo": "empReview_12099066",
        "employeeType": "Current Employee - Software Engineer",
        "position": "I have been working at Snap full-time (Less than a year)",
        "summary": "Awesome company, loving the direction and vision!",
        "pro": "- We're located right in the beach!- There's free food with 2 cafeterias + restaurants around work are free too- Salary is on par with SF/Bay area companies- Equity package is solid but strongly incentivizes you to stay 4 years. This is a pro (very low turnover ratio + coworkers are all very involved in the success of the company) and a con (lose out on equity if you leave early)",
        "con": "- Offices are spread out, need to walk 10min between them sometimes.- Equity package has backloaded vesting schedule so you have to stay 4 years for full benefit",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW12099066.htm"
    },
    "16": {
        "key": "16",
        "date": " Nov 7, 2016",
        "reviewNo": "empReview_12595257",
        "employeeType": "Current Employee - Engineer",
        "position": "I have been working at Snap full-time (Less than a year)",
        "summary": "Be very very careful",
        "pro": "Stock and compensation.Free food.Benefits aren't bad for a start up.Being in Venice beach is nice.",
        "con": "Work life balance is hands down the worst I have ever experienced in my entire career. I have overheard management indicating that it's okay to ride employees very hard because \"nobody in their right mind would leave the equity on the table.\" Very toxic culture. Expect 60+ hours a week and the majority of weekend and company holidays to be mandatory. Even if you are doing 60 hours a week, expect to get dirty looks because of the Amazon-on-steroids workaholic culture that is imposed from the top down. I cannot stress enough how bad the work life balance is. If you are considering an offer, you should consider it a trade for 4 years of feeling horrible.Management is incredibly inexperienced, out of touch, and has no grasp on reality. Decisions at the top level are completely arbitrary and leadership regularly ignores the advice of their subordinates. Management will send out mails after a mandatory weekend telling employees how it was \"so cool\" and \"felt like a startup again.\"You will absolutely have your skills squandered and ideas suppressed. As the company nears IPO, people are focused on empire building and keeping high quality talent suppressed. This leads to a ton of C-list talent being hired, which is very frustrating. It's very typical for only a narrow segment of your skills to be utilized and attempting to change that will incur a heavy penalty.",
        "advice": "Clean house. Seriously. The Amazon-on-steroids culture will ruin the company and scare all of the good talent away.",
        "overallStar": "1",
        "workLifeStar": "1",
        "cultureStar": "1",
        "careerOppStar": "1",
        "comBenefitsStar": "1",
        "srManagementStar": "1",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW12595257.htm"
    },
    "17": {
        "key": "17",
        "date": " Oct 27, 2016",
        "reviewNo": "empReview_12471446",
        "employeeType": "Former Employee - Software Engineer",
        "position": "I worked at Snap full-time (More than a year)",
        "summary": "great experience",
        "pro": "great experience at a company, easy going people, interesting stuff to work on, and overall great environment and community. The location is great as well, close to the beach in Venice.",
        "con": "can't think of any cons. really.",
        "advice": "keep up the good work, rely more on employees to build the culture and to come up with interesting features to add value to the current user's base.",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW12471446.htm"
    },
    "18": {
        "key": "18",
        "date": " Jul 21, 2016",
        "reviewNo": "empReview_11311840",
        "employeeType": "Current Employee - Product Designer",
        "position": "I have been working at Snap full-time (More than 3 years)",
        "summary": "Product Design",
        "pro": "-Great Benefits (matching 401k, dental/vision/medical, anyPerk)-Great Food (2 cafeterias, multiple free restaurant partnerships)-Awesome Workspaces-Insane Growth Rate",
        "con": "-Expanding constantly, campus scattered throughout LA-Hard to meet people outside of your team and those you interface with for work (although bi-weekly council helps a lot with this)",
        "advice": "Excited to be moving to more centralized space. Keep employees more informed about goings-on outside of the day-to-day. Continue with transparency policies that have steadily improved.",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW11311840.htm"
    },
    "19": {
        "key": "19",
        "date": " Nov 24, 2015",
        "reviewNo": "empReview_8743663",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap full-time (Less than a year)",
        "summary": "Software Engineer",
        "pro": "Friendly, young people. Strict code review. Good engineering culture. Partnered with quite a few restaurant, free food everywhere. Innovation everywhere, top down / bottom up.",
        "con": "Don't come here if you want a free ride to IPO. Everyone works hard to drive it.",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW8743663.htm"
    },
    "20": {
        "key": "20",
        "date": " Jul 27, 2015",
        "reviewNo": "empReview_7366696",
        "employeeType": "Current Employee - Sales and Marketing",
        "position": "I have been working at Snap full-time (Less than a year)",
        "summary": "An incredibly exciting environment",
        "pro": "-Snapchat NYC is a blast. In less than a year, the office has grown immensely. You won't find any bean bag chairs or ball pits here like at other startups, but you will find a small, scrappy group of enthusiastic folks building a vibrant team in New York.-If you work hard and seek out new ways to help your team, there's a ton of potential to move up and even take on new responsibilities within the company (even in Snapchat's LA headquarters). We're growing fast!-Really enjoy Council, Snapchat's every-other-weekly \"talk about your feelings\" group sessions. The NYC team is super high-energy, so it's always fun and maybe even sometimes enlightening!",
        "con": "-Working with west coast folks can be tough because of the time difference, but rest assured you'll never be alone in the NY office. Between the sales team and the round-the-clock curation team, there's always someone to hang with (or grab Shake Shack with).-Like I said, the office is very high energy. It can get loud!-Don't expect much hands-on time with the CEO. But.... do expect late-night karaoke and bonding with the NY team!",
        "advice": "More places to meet. Two conference rooms is not nearly enough.",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW7366696.htm"
    },
    "21": {
        "key": "21",
        "date": " Jun 11, 2017",
        "reviewNo": "empReview_15429472",
        "employeeType": "Current Employee - Software Engineer",
        "position": "I have been working at Snap full-time (Less than a year)",
        "summary": "Amazing perks! Fun place to work!",
        "pro": "- Flexible timings; Good work life balance.- More of ownership culture similar to Google, FB etc.- Salary is good.- Free food with option to dine out at restaurants.- They pay for your phone bill.- Free Gold's gym membership.- Tons of company events like Santa Monica pier party, Cinema screening etc.",
        "con": "Since it's relatively new company there are lot of policies that need time to settle in.",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW15429472.htm"
    },
    "22": {
        "key": "22",
        "date": " May 17, 2017",
        "reviewNo": "empReview_15101018",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap full-time (More than a year)",
        "summary": "Amazing experience",
        "pro": "Visionary CEO. Not following/copying others but blazing a new trail. Fast-moving, super creative culture. Bringing new technology to the world, and changing the way the world communicates. Kind people. Getting to try new ways of doing things. Supportive peers. Autonomy from management. Cool offices. Free food (on-site at the cafeterias or via food card at local restaurants), great perks (dog walking, surrogacy, and egg-freezing) and free health benefits for my family.",
        "con": "Fast-moving culture--big dreams and huge aspirations. Working on stuff that's never been done before means you have to create your own path. If you're not a smart, kind & humble person, don't bother applying. Jerks get let go within their first month.",
        "advice": "This is the best company I've ever worked for and I love working here. Don't let the company culture change as we grow larger.",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW15101018.htm"
    },
    "23": {
        "key": "23",
        "date": " Jun 15, 2017",
        "reviewNo": "empReview_15496717",
        "employeeType": "Former Employee - Customer Operations Specialist",
        "position": "I worked at Snap full-time (Less than a year)",
        "summary": "Great atmosphere, friendly employees.",
        "pro": "Very great job culture as far as the employees. Everyone is creative and outgoing. It's located near the beach (recently moved from Venice to Santa Monica) and happy hours are frequent. Most of the employees are super cool and theres definitely a family vibe.",
        "con": "Work loads can get stressful at times and certain managers are very indirect so it stunts your growth and what you need to work on to improve.",
        "advice": "Be more direct, more honest, and stop running from conflict.",
        "overallStar": "4",
        "workLifeStar": "4",
        "cultureStar": "4",
        "careerOppStar": "4",
        "comBenefitsStar": "4",
        "srManagementStar": "4",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW15496717.htm"
    },
    "24": {
        "key": "24",
        "date": " Apr 22, 2017",
        "reviewNo": "empReview_14741374",
        "employeeType": "Current Employee - Software Engineer",
        "position": "I have been working at Snap full-time (More than a year)",
        "summary": "Getting there",
        "pro": "Opportunity to make a large impact for feature development or performance improvementOpportunity to work with smart/entrepreneur peopleGood/Free food/drinks and reasonable allowance to eat from local restaurants as wellStrong intern programStrong salary,stock,refreshment programStrong product review/eng process for releasesVision: Evan Spiegel/Design team is awesome for product vision and discussing new ideasStrong engineering leadershipWork/Life balance is fine. You don't have to work on weekends. It is similar to other large tech companies.Innovative and ambitious culture",
        "con": "Don't have an established campusOffice space sucks compare to Google/MicrosoftNot much established for review/performance systemToo much new grads (but this is changing recently)Leveling system for engineers does not seem rightEach new stock vesting schedule same as initial hiring stockFavoritism for closeness to Evan or Directors/VPs etcNot enough conference rooms",
        "advice": "Get out of VeniceToo much designer focusedListen to your engineers for suggestionsDirectors need to have a better management experienceCompetitive strategy is neededStop favoring people and be transparent",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW14741374.htm"
    },
    "25": {
        "key": "25",
        "date": " Apr 28, 2017",
        "reviewNo": "empReview_14836926",
        "employeeType": "Former Employee - Anonymous Employee",
        "position": "I worked at Snap full-time (More than a year)",
        "summary": "Curation",
        "pro": "Amazing people, good benefits, an unbeatable sense of pride. Worth drinking the Kool-Aid.",
        "con": "Management across the board is too young and inexperienced. Departments are isolated from one another. Employees are treated as invaluable one moment, disposable the next. Extremely high-stress, terrible hours.",
        "advice": "Be visible. Improve diversity in the workplace. Be a little more human when dealing with your employees - they will give you so much more when they are taken care of.",
        "overallStar": "3",
        "workLifeStar": "3",
        "cultureStar": "3",
        "careerOppStar": "3",
        "comBenefitsStar": "3",
        "srManagementStar": "3",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW14836926.htm"
    },
    "26": {
        "key": "26",
        "date": " Apr 14, 2017",
        "reviewNo": "empReview_14629937",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "None",
        "summary": "Intern",
        "pro": "Great people who really believe in the product.",
        "con": "It's like building an airplane while flying it and with no GPS.",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW14629937.htm"
    },
    "27": {
        "key": "27",
        "date": " Apr 12, 2017",
        "reviewNo": "empReview_14608483",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap full-time",
        "summary": "Awesome place to work!",
        "pro": "I'm surrounded by intelligent and hard-working colleagues who are down to earth and friendly. Great location in Venice and amazing benefits.",
        "con": "The only downside is the offices in Venice are spread apart which means you need to plan for travel time to and from each location. But it's nothing to really complain about.",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW14608483.htm"
    },
    "28": {
        "key": "28",
        "date": " Apr 4, 2017",
        "reviewNo": "empReview_14489627",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap part-time",
        "summary": "Story Editor",
        "pro": "The people and location are one of a kind",
        "con": "Part-time is rough when you want to fully engage in Snap culture",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW14489627.htm"
    },
    "29": {
        "key": "29",
        "date": " Apr 25, 2017",
        "reviewNo": "empReview_14789117",
        "employeeType": "Former Employee - Software Engineer",
        "position": "I worked at Snap full-time (More than a year)",
        "summary": "Abusive management.",
        "pro": "Able to work at a fairly rapid pace, though this came at the cost of not writing tests and peer reviews consisted of people just scanning the code. Compensation is fair considering market.",
        "con": "Work/life balance: We are regularly reminded that we're expected to come back online to work after dinner. God help you if your Hipchat dot isn't green. Weekends and working into the morning are a regular thing.Culture: It's said that a company's true culture is defined by those they reward and promote, as opposed to what they tout. And it's evident that Snap values managers who bully and intimidate to motivate their team and robots that blindly follow.Feedback system: Snap has no concept of reviews for peers or for management, so they stay oblivious to problems (perhaps willingly).Code quality: Peer reviews generally consist of someone scanning the code, not running it. No tests are written. This results in bugs slipping through to production apps.Unfortunately these issues seem to come from the top down; they are rooted deeply in the culture of Snap. Leaving Snap was like finally leaving an abusive relationship.",
        "advice": "Implement upwards and 360 reviews, don't stay blind to bullying from your management team. You will continue to hemorrhage talent.",
        "overallStar": "1",
        "workLifeStar": "1",
        "cultureStar": "1",
        "careerOppStar": "1",
        "comBenefitsStar": "1",
        "srManagementStar": "1",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW14789117.htm"
    },
    "30": {
        "key": "30",
        "date": " Mar 30, 2017",
        "reviewNo": "empReview_14421913",
        "employeeType": "Current Employee - Content Marketing Specialist",
        "position": "I have been working at Snap full-time (Less than a year)",
        "summary": "Content Specialist",
        "pro": "Free food is awesome!Collaborative spaceGreat people who are passionate about the app and the companies success",
        "con": "You can sometimes feel out of the loop. As the company continues to grow, there is a huge opportunity for more communication. We act like a small company where \"word of mouth\" is a great way for communication. However, it's grown so much so this isn't a successful tactic anymore.If you're a process ordinated person, you may find this company a bit difficult to work with. However, may be a great opportunity to leverage that expertise to shine. Also, you have to be an advocate for yourself because management is \"eh\". Promote yourself and talk yourself up!",
        "advice": "Many aren't ready to be managers as well as didn't come to the company with the drive to manager. Somehow they just got put there because we were growing so rapidly.",
        "overallStar": "4",
        "workLifeStar": "4",
        "cultureStar": "4",
        "careerOppStar": "4",
        "comBenefitsStar": "4",
        "srManagementStar": "4",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW14421913.htm"
    },
    "31": {
        "key": "31",
        "date": " May 1, 2015",
        "reviewNo": "empReview_6486086",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "None",
        "summary": "Exciting as can be",
        "pro": "Working at Snapchat is never boring. There are few companies in the world where you can have as big an impact on the culture that you live in. The people at Snapchat are brilliant, friendly, and inspiring.",
        "con": "At Snapchat people work hard and sometimes struggle to find a good work/life balance. Though there are no rules on when to come in and when to leave, most employees are self motivated enough to get in early and stay late.",
        "advice": "Management at Snapchat is always pushing employees to do what they thought was impossible. This often results in accomplishments that far surpass what people thought was possible.",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW6486086.htm"
    },
    "32": {
        "key": "32",
        "date": " Apr 16, 2015",
        "reviewNo": "empReview_6362972",
        "employeeType": "Current Employee - Software Engineer",
        "position": "I have been working at Snap full-time (Less than a year)",
        "summary": "Wonderful experience to be part of a passionate and fun loving team.",
        "pro": "- Interview Experience: Unlike other big name companies, the entire interview process was very smooth, quick and well structured. It took me about 2 weeks from the time the recruiter first contacted me to the time I got the offer. The recruiters were really prompt on following up on all the minor details, very adjustable to scheduling and quick to respond on interview results. The overall interview experience itself was unique where I had my lunch interviewer take me for a walk by the beach after having lunch with the entire team. The interviews were very similar to what you expect at any top tech company but I really liked the fact that I was allowed to code in an IDE of my choice instead of writing on white board.- On-boarding process: The new hire on-boarding process is brief and to the point. It was a sweet surprise to see that people already know you by name when you are taken for walk around the campus buildings.- Engineering team: The engineering team is well organized and well structured. Its a great opportunity to do full stack development where you are allowed to work on features end to end. There is a strong sense of ownership and commitment to deliver features. Every team has a good mix of junior and senior developers. Since it is such a small team and the product is growing continuously, there are plenty of opportunities to showcase your potential and grow.- Work: Because of the unique and ephemeral nature of the product, the work is really challenging and interesting. It's good to have your entire day focussed on solving the problem as I spend less than 30 minutes a day on emails and meetings. It also allows me to get work done quickly and leave early.- Office space: Although, I was initially skeptical about working in an office space right by the beach, I have started to really like it now. Its literally a beach house transferred to office space and it has all the amenities with an amazing view from the roof top and the deck. Whenever I see myself getting stuck in a problem, I tend to go for a walk by the beach to the shore and refresh myself. Sometimes, we just go out and relax ourselves with a game of volley ball. The office staff are really kind and there is security people in and around the building 24X7.- Food: It's really great that I can turn up at work and not worry about cooking lunch or dinner as food is prepared by the chef daily and the entire team has lunch together. If you want to eat outside, there is also an option to eat at a few handpicked restaurants just by showing your badge.- Transparency: Every engineering team meets with the leadership team on weekly basis where we are told about all the different things happening within the company - new features, growth, monetization strategy, etc. It is quite amazing to see the level of business details shared with the engineering team.- Compensation: The base pay is comparable to any other top tech companies and no other tech company can match the equity portion provided here.",
        "con": "#NAME?",
        "advice": "Keep up the good work and ensure that the culture of snapchat remains intact as we continue to grow.",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW6362972.htm"
    },
    "33": {
        "key": "33",
        "date": " Apr 15, 2015",
        "reviewNo": "empReview_6351823",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap full-time (Less than a year)",
        "summary": "Excellent place to work with top-notch colleagues and excellent environment",
        "pro": "1. Building and improving a great product with a fast growing user base.2. A top-notch engineering environment. I enjoyed working with a lot of brilliant colleagues every day.3. Actively listening to users' feedbacks and reacting to them very quickly4. Excellent working environment, right next to the Venice Beach. I've worked in a number of companies before and this is the best working place so far.",
        "con": "Not much that I am aware of. Probably try to find more good people to join the company, and work on this great product together.",
        "advice": "The engineering team has done a lot of amazing work internally. It will be great to consider sharing some of those experience and practice back to the community.",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW6351823.htm"
    },
    "34": {
        "key": "34",
        "date": " Aug 28, 2014",
        "reviewNo": "empReview_4868280",
        "employeeType": "Current Employee - Software Developer",
        "position": "I have been working at Snap full-time (Less than a year)",
        "summary": "Excellent decision to work here!",
        "pro": "Given the general media perception of the company, when I joined the company, I was expecting it to be less serious and more flamboyant than most new age tech firms today. However, Snapchat is a place that turned out to be as, if not a little more serious, than most of them. The people here are extremely driven and motivated.I think what drives a lot of Snapchat's views, beliefs, and policies, is the fact that it has not let its ideologies be motivated or influenced by external stimuli. Most of the decisions taken here are very objective and independent, and unlike a lot of what I saw at various Bay Area firms. A lot of this originates from the upper level management.My favorite thing about working here is being in the middle of such a rapid and crucial growth phase. Being an active part of such growth is a very educational process, and it is really motivating to see people going above and beyond to push the company forward. It really shows and promotes a general sense of ownership and dedication.",
        "con": "Rapidly growing company size means reducing personal touch with everyone else. Also, it would be nice to have more company-organized and company-wide activities.",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW4868280.htm"
    },
    "35": {
        "key": "35",
        "date": " Aug 28, 2014",
        "reviewNo": "empReview_4863647",
        "employeeType": "Current Employee - Software Engineer",
        "position": "I have been working at Snap full-time (Less than a year)",
        "summary": "An extremely challenging/rewarding work experience",
        "pro": "Being able to take ownership of huge projects that will have a direct impact on the product.Having passionate coworkers.Being lead by people with an amazing vision for the company/product.Seeing others use the product every day.Working on innovative features.Having lots of responsibilities.",
        "con": "Having lots of responsibilities means having to work. A LOT. But that's part of the fun.",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW4863647.htm"
    },
    "36": {
        "key": "36",
        "date": " Aug 18, 2014",
        "reviewNo": "empReview_4802190",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap full-time (Less than a year)",
        "summary": "No Other Place I Would Rather Work!",
        "pro": "- Amazing leadership team that inspires innovation and design thinking throughout the product and company culture- Family atmosphere without organizational politics. Exceptionally talented, educated and humble colleagues.- Focused on delivering a personal and fun customer experience- Opportunity to see the product and market impact of your contributions. Empowered to make product decisions.- Excellent work environment: State of the art technology, software tools and well designed work spaces.- Food: Onsite professional chef with 95% organic food, ie salads, salmon and rib eye steaks!- A block from Venice Beach. Amazing weather and air quality. Located in the heart of art, fashion and fun.- Daily commute: 7 minute bike ride along paved beach bike path - view of surfers and Bay Watchers in training- Highly competitive financial incentives, medical / dental insurance, retirement plans, and perks",
        "con": "- Rapid growth of the company has impacted car parking- The dining hall is reaching capacity due to rising headcount- Monthly sunblock purchases ; )",
        "advice": "Continue the pace of talent acquisition, making bold choices, and focusing on customer experience. You are on the right path!",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW4802190.htm"
    },
    "37": {
        "key": "37",
        "date": " Jul 12, 2014",
        "reviewNo": "empReview_4568454",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap full-time (Less than a year)",
        "summary": "Amazing place to work",
        "pro": "#NAME?",
        "con": "#NAME?",
        "advice": "Keep it going.",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW4568454.htm"
    },
    "38": {
        "key": "38",
        "date": " Jul 7, 2013",
        "reviewNo": "empReview_2800001",
        "employeeType": "Current Employee - Software Engineer",
        "position": "I have been working at Snap full-time (Less than a year)",
        "summary": "Amazing place to work",
        "pro": "* Small team* Well funded* Intelligent and dedicated coworkers* Huge impact on product that has pretty large user base* Work out of a beach house* Salary competitive to large tech companies - not a startup salary* Lage equity grants* Good connections* Office is on Venice beach - balcony gives great view of the ocean* Vision is inspiring",
        "con": "* Beach house can be distracting* Lot of work - some social sacrifices need to be made* Lot of responsibility over product - stressful at times",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW2800001.htm"
    },
    "39": {
        "key": "39",
        "date": " Jun 28, 2017",
        "reviewNo": "empReview_15675727",
        "employeeType": "Current Employee - Program Manager",
        "position": "I have been working at Snap full-time (More than a year)",
        "summary": "Excellent Company",
        "pro": "Great LocationGreat FoodNice PeopleAwesome space for creativity",
        "con": "The company tends to be very secretive. Often times products are learned about by employees at the same time as the public. Not the worse thing, however would like more internal communication in the future.",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW15675727.htm"
    },
    "40": {
        "key": "40",
        "date": " Jun 26, 2017",
        "reviewNo": "empReview_15639142",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap full-time",
        "summary": "Software Engineer",
        "pro": "Opportunity to learn many things",
        "con": "Can't think of any right now.",
        "advice": "None",
        "overallStar": "4",
        "workLifeStar": "4",
        "cultureStar": "4",
        "careerOppStar": "4",
        "comBenefitsStar": "4",
        "srManagementStar": "4",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW15639142.htm"
    },
    "41": {
        "key": "41",
        "date": " Jun 28, 2015",
        "reviewNo": "empReview_7047949",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap full-time (Less than a year)",
        "summary": "Not perfect, but getting there",
        "pro": "#NAME?",
        "con": "+tempestuous and cocky ceo.+many inexperienced coworkers. lots of kids hired because they went to crossroads with evan or are someone seemingly important's kid+splintered offices in an isolated, expensive location. very poor sense of company culture.",
        "advice": "get a real COO that will foster company culture. i really cannot emphasize how important it is to have a mission statement and credo outside of vague and tired axioms. a company will die without one (see nasty gal's internal implosion as a great example.) and we REALLY need one, central office in a better location (sorry, but venice is godawful and incredibly expensive to boot) we need more mature c-levels and directors as well. i'm excited to see what will fall into place post-IPO and i know snapchat is the future.",
        "overallStar": "3",
        "workLifeStar": "3",
        "cultureStar": "3",
        "careerOppStar": "3",
        "comBenefitsStar": "3",
        "srManagementStar": "3",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW7047949.htm"
    },
    "42": {
        "key": "42",
        "date": " Aug 11, 2015",
        "reviewNo": "empReview_7540502",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap (More than a year)",
        "summary": "Snapchat is",
        "pro": "Snapchat is building the world that I not only want to live in, but more importantly, want to help create, and we're doing it with an absolutely amazing team - brilliant, humble, focused, and ambitious.I'm particularly inspired and impressed by the manner in which we've designed a place and fostered a community that honors and appreciates experimentation, boldness, creativity, and truth. And how, in doing so, we're enabling, encouraging, and inspiring everyone (particularly artists, journalists, musicians, actors, and directors) to create and share feelings, emotions, expressions, works of art, and themselves with Snapchat, on Snapchat, and for the world.Just thinking about the impact that this will have, the industries that we will transform, and the future that we are creating excites and invigorates me.",
        "con": "What's good:+ The people and kind and empathetic; I’ve seen the team go above and beyond when someone is having a hard day or going through a family tragedy.+ If you’re a voracious learner there is no better environment to grow than a fast paced start-up; I'm given a huge amount of autonomy and ownership, which at times can be scary but, in a little over a year I’ve grown so much. I am so grateful for the opportunity. Also we have awesome speaker series!+ We have a lot of fun; whether it’s blasting music on Friday’s, spending time at team-offistes, beach volley-ball games, or getting together for an hour on Wednesday’s for a company sponsored council.",
        "advice": "More structured performance evaluations, greater insights in to up-and-coming products and overall strategy.",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW7540502.htm"
    },
    "43": {
        "key": "43",
        "date": " Aug 2, 2015",
        "reviewNo": "empReview_7434378",
        "employeeType": "Current Employee - Software Engineer",
        "position": "I have been working at Snap full-time (Less than a year)",
        "summary": "My Heart is in the work here",
        "pro": "- I just joined some 3-4 weeks back, but the kind of responsibility and ownership I have is a lot- Love the technology here- Incredibly helpful and smart co-workers- Growth potential and impact are beyond any measures",
        "con": "Teams are spread apart and it is hard to know what's going on in other teams.",
        "advice": "Build more impactful teams and recognize impactful talents.",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW7434378.htm"
    },
    "44": {
        "key": "44",
        "date": " Jun 17, 2015",
        "reviewNo": "empReview_6941153",
        "employeeType": "Current Employee - Product Designer",
        "position": "I have been working at Snap full-time (More than a year)",
        "summary": "Great place to work!",
        "pro": "#NAME?",
        "con": "#NAME?",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW6941153.htm"
    },
    "45": {
        "key": "45",
        "date": " Jul 11, 2015",
        "reviewNo": "empReview_7190681",
        "employeeType": "Current Employee - Software Engineer",
        "position": "I have been working at Snap full-time (More than a year)",
        "summary": "Worst experience in my career so far",
        "pro": "1. Working at the beach2. Free food3. Learn new things",
        "con": "1. Work is not very interesting or challenging2. Employees are required to work on very menial tasks, irrespective of their interests3. The user growth for the product is stalling. There is literally no active user growth in the last 5-6 months4. Senior management lacks vision, capability and good team-building skills",
        "advice": "Be fair, Be nicer and Be reasonable.",
        "overallStar": "1",
        "workLifeStar": "1",
        "cultureStar": "1",
        "careerOppStar": "1",
        "comBenefitsStar": "1",
        "srManagementStar": "1",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW7190681.htm"
    },
    "46": {
        "key": "46",
        "date": " Apr 13, 2015",
        "reviewNo": "empReview_6328062",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap full-time",
        "summary": "Poor management. Negative culture.",
        "pro": "#NAME?",
        "con": "- Top-level management is churning, most recently our COO- Unpolished CEO who loves to fly off the handle and fire people who disagree with him- Complete secrecy and lack of trust: even as an employee & shareholder you're not allowed to know any information about the company: projects, users, valuation, etc.- Face-time in the office matters. Unlike every other tech company, working from home is frowned upon. But you'll be too scared to ask, so it doesn't matter.- Mandatory Wednesday evening meetings.... seriously.- Very junior leadership across the company- Shocking amounts of red-tape and bureaucracy for such a small company- Negative, fear-driven, top-down culture- Less competitive salaries, benefits, & perks to Silicon Valley competitors (see below)- Horrific equity vesting schedule over 4 years: 10%, 20%, 30%, 40% whereas almost every other company you vest 25% a year for 4 years.- 10 days of PTO a year and 5 sick days (No, I'm not joking, and yes this is 2015. Better not get sick this year... or any year!)- No performance reviews/salary adjustments, etc.- No bonus structure- No 401k matching- All those really cool tech company perks you've heard about: we don't have any of them.- Far from the rest of the tech community in the Silicon Valley (means limited options when it's time to change jobs)- Cost of living in Venice/Santa Monica is insane. Bay Area prices.Less Egregious Cons:- Working by Venice beach can actually be pretty annoying, loud, or even scary- If you didn't join the company early enough to get a parking spot, you have to park in a lot 1 mile away and take a (free) shuttle to the office. The shuttle starts going back to the lot in the evening at 6pm. Good luck getting home if you need to leave before that (but you won't need to leave before 6, because you'll be too scared to ask)",
        "advice": "Wrangle in the CEO. No one wants to be cussed at or threatened at work.Get someone to head up HR who can deconstruct the toxic culture and build something awesome.Treat your employees like you actually trust them: let them work from home when they need/want, let them know what the company is working on so they can be excited, celebrate victories and milestones,Stop the fake, overly curated reviews on Glassdoor. Try ACTUALLY making it a great place to work, then we won't have to lie about it.",
        "overallStar": "1",
        "workLifeStar": "1",
        "cultureStar": "1",
        "careerOppStar": "1",
        "comBenefitsStar": "1",
        "srManagementStar": "1",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW6328062.htm"
    },
    "47": {
        "key": "47",
        "date": " May 25, 2015",
        "reviewNo": "empReview_6698830",
        "employeeType": "Current Employee - Content Analyst",
        "position": "I have been working at Snap part-time",
        "summary": "Content Analyst",
        "pro": "Great pay for the workFlexible workEntertaining job",
        "con": "No advancement positionsCan become boring at times",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW6698830.htm"
    },
    "48": {
        "key": "48",
        "date": " May 1, 2015",
        "reviewNo": "empReview_6491153",
        "employeeType": "Current Employee - Designer",
        "position": "I have been working at Snap full-time (More than a year)",
        "summary": "Great place to work with a bright future :)",
        "pro": "Amazing colleagues, the ability to work on many different projects at once, the location is incredible. I actually have people I consider friends here and we're all very supportive of each other.",
        "con": "Growing very fast, and it sometimes feels too fast. I miss knowing everyone, but that's a part of a growing company. So pretty much classic startup growing pains.",
        "advice": "Be very wary that we are a growing company, and try to maintain that perspective as we continue to grow. Try to hold onto the values and culture we had as a smaller startup, and carry them through as we expand. It's what makes us special :)",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW6491153.htm"
    },
    "49": {
        "key": "49",
        "date": " May 28, 2015",
        "reviewNo": "empReview_6726428",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap full-time (Less than a year)",
        "summary": "Rapidly growing, challenging, (very) unstructured fun",
        "pro": "#NAME?",
        "con": "- Campus is a bit spread out so it can be hard to know what everyone else is working on without a lot of overcommunication- We used to do really poor job at comms and PR. We get a lot of hate thrown at us in the media because of things like what our founder said when he was in college, what disgruntled (fired) employees have said publicly against us, etc. Sometimes it seems like everyone want us to fail and we play the villain, even from other tech companies who are usually so supportive and collaborative (they probably don't like that we hire their engineers). It can be annoying and disparaging to hear good people say such bad things about a place you know to be awesome.- Still figuring out things like facilities and benefits as we outgrow what we have. No big deal, but it's not the Googleplex for those who want to be pampered",
        "advice": "Please do a better job with comms and PR -- the world should know how great Snapchat is internally. Hire role models. Ensure communication channels stay open, make changes to easy-to-fix things like vacation policy, keep innovating.",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW6726428.htm"
    },
    "50": {
        "key": "50",
        "date": " Apr 16, 2015",
        "reviewNo": "empReview_6364914",
        "employeeType": "Current Employee - Software Engineer",
        "position": "I have been working at Snap full-time (Less than a year)",
        "summary": "Great place to work for engineers. Why didn't I think of working on the beach sooner?",
        "pro": "#NAME?",
        "con": "#NAME?",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW6364914.htm"
    },
    "51": {
        "key": "51",
        "date": " Aug 30, 2016",
        "reviewNo": "empReview_11744027",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "None",
        "summary": "Great company",
        "pro": "Massive growth opportunity at a founder-led company with a growing user base.Tons of monetization opportunities.",
        "con": "Work/life balance. But this is to be expected from an upstart.",
        "advice": "Keep innovating and disrupting",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW11744027.htm"
    },
    "52": {
        "key": "52",
        "date": " Aug 3, 2016",
        "reviewNo": "empReview_11448186",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap full-time",
        "summary": "Roller coaster but fun",
        "pro": "Energetic environment, hard-working staff, exciting place to work",
        "con": "Lack of structure, lack of public transparency",
        "advice": "Create more official company-wide policies",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW11448186.htm"
    },
    "53": {
        "key": "53",
        "date": " Jun 28, 2016",
        "reviewNo": "empReview_11073126",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap full-time (More than a year)",
        "summary": "Wild West",
        "pro": "It's a start-up, so things change quickly.",
        "con": "It's a start-up, so it can be disorganized.",
        "advice": "None",
        "overallStar": "4",
        "workLifeStar": "4",
        "cultureStar": "4",
        "careerOppStar": "4",
        "comBenefitsStar": "4",
        "srManagementStar": "4",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW11073126.htm"
    },
    "54": {
        "key": "54",
        "date": " Jan 2, 2016",
        "reviewNo": "empReview_9049806",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "None",
        "summary": "Data Scientist",
        "pro": "aggressive startup, interesting product and good culture",
        "con": "No other offices in other city, country...",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW9049806.htm"
    },
    "55": {
        "key": "55",
        "date": " Feb 3, 2016",
        "reviewNo": "empReview_9443606",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "None",
        "summary": "Awesome place to work!",
        "pro": "culture, friendly people, location (beachfront), fun products, good benefits, council system",
        "con": "a little disorganized/unstructured, no real campus",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW9443606.htm"
    },
    "56": {
        "key": "56",
        "date": " Jan 20, 2016",
        "reviewNo": "empReview_9276842",
        "employeeType": "Former Employee - Anonymous Employee",
        "position": "I worked at Snap full-time",
        "summary": "Content Moderator",
        "pro": "There is a cool and very open environment which enables you to collaborate well with your coworkers. The people are fun to work with, and the perks are great (fully-stocked kitchen).",
        "con": "The hours were very random, and sometimes ran from midnight until 6am, or 6am until noon. Also the fun atmosphere sometimes made it hard to focus and get work done.",
        "advice": "None",
        "overallStar": "4",
        "workLifeStar": "4",
        "cultureStar": "4",
        "careerOppStar": "4",
        "comBenefitsStar": "4",
        "srManagementStar": "4",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW9276842.htm"
    },
    "57": {
        "key": "57",
        "date": " Dec 3, 2015",
        "reviewNo": "empReview_8817102",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap full-time",
        "summary": "Content Analyst",
        "pro": "Awesome culture, great people, fun opportunities",
        "con": "Weird hours but fun to be at work so not too bad",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW8817102.htm"
    },
    "58": {
        "key": "58",
        "date": " Oct 5, 2015",
        "reviewNo": "empReview_8190741",
        "employeeType": "Former Employee - Anonymous Employee",
        "position": "None",
        "summary": "Software Developer Intern",
        "pro": "A great place to work with a wonderful location with the best weather in the world. A lot of fun and I met a lot of cool people",
        "con": "A little disorganized at first, but most likely because they were rapidly expanding and were figuring things out along the way",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW8190741.htm"
    },
    "59": {
        "key": "59",
        "date": " Apr 21, 2015",
        "reviewNo": "empReview_6404745",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "None",
        "summary": "The best experience of my professional career thus far.",
        "pro": "Snapchat has been the best experience of my professional career thus far. It is a true start-up, but without the risks. No job is too small or too large, and the amount of impact and influence you have in your role (whether you're an intern or an exec) is infinite. It's a collaborative and friendly environment, and the organization truly values and invests in the individuals.The work is fast paced and challenging and you're surrounded by the most intelligent individuals on a daily basis. If you're looking for growth and excitement, you will find it at Snapchat.",
        "con": "Hours can be long and the workload can be heavy. I don't necessarily see this as a con, however, as the growth potential as an individual due to these two factors is bigger than I've seen at most companies.Also note that Snapchat is not the kind of place for someone looking for frills and perks. It's a place to get your hands dirty and there are times where you might be working on projects outside of your day-to-day responsibilities. For some, like myself, I love this. For others, this can be frustrating and if you're the type of person that's looking for routine and predictability, this place probably isn't for you. Snapchat requires flexibility and a team oriented mentality.",
        "advice": "Continue to enable, encourage and invest in the talent. As the organization grows, would love to see the culture stay intact. Also given the rapid growth, would like to see us stay away from becoming too process driven, as some organizations move in this direction.",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW6404745.htm"
    },
    "60": {
        "key": "60",
        "date": " May 7, 2015",
        "reviewNo": "empReview_6536346",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap full-time",
        "summary": "Secretive Culture",
        "pro": "It is a company with a lot of potential.",
        "con": "Bad management. Secretive culture. You have to drink the Kool-Aid or you are shunned.",
        "advice": "None",
        "overallStar": "1",
        "workLifeStar": "1",
        "cultureStar": "1",
        "careerOppStar": "1",
        "comBenefitsStar": "1",
        "srManagementStar": "1",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW6536346.htm"
    },
    "61": {
        "key": "61",
        "date": " Aug 18, 2014",
        "reviewNo": "empReview_4801614",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap full-time (More than a year)",
        "summary": "Highly recommended",
        "pro": "One of my favorite things about working at Snapchat is seeing people use the application. I can't remember the last time I was out and didn't see a random person on the street using our application. It's incredibly rewarding to see people use and love the application that you helped create.Also, being a part of a company that is growing quickly also accelerates your learning as you get to see and help to solve the problems that companies face at each stage of growth.",
        "con": "The biggest con is the stress of the work. A lot is expected of you, and a lot of responsibility is thrust upon you.",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW4801614.htm"
    },
    "62": {
        "key": "62",
        "date": " Aug 11, 2016",
        "reviewNo": "empReview_11526371",
        "employeeType": "Current Employee - Anonymous Employee",
        "position": "I have been working at Snap part-time",
        "summary": "Snapchat employee",
        "pro": "Amazing leadership, fast response, good salary",
        "con": "I cant come up with any cons",
        "advice": "None",
        "overallStar": "5",
        "workLifeStar": "5",
        "cultureStar": "5",
        "careerOppStar": "5",
        "comBenefitsStar": "5",
        "srManagementStar": "5",
        "reviewLink": "https://www.glassdoor.com/Reviews/Snap-Reviews-E671946.htm/Reviews/Employee-Review-Snap-RVW11526371.htm"
    }
}